# Pandas

In [1]:
# Importando o Pandas.
import pandas as pd

In [2]:
# Lendo uma base de dados no formato .csv.
# o parâmetro sep é usado para definir qual o separador entre os dados.
# o parâmetro header informo em qual linha está minhas colunas ou se elas não existem.
# Se não existe colunas (header=None) o pandas dará um número para cada atributo da base.
arquivo = 'dados/kc_house_data.csv'

df = pd.read_csv(arquivo, sep=',' ,header=0)

In [3]:
# Imprimindo o tipo da variável dataset
# Dataframe é um estrutura de dados onde linhas podem ter colunas de diferentes tipos.
type(df)

pandas.core.frame.DataFrame

In [4]:
# Metodo head() imprime as 5 linhas iniciais do dataframe.
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3.0,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3.0,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2.0,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4.0,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3.0,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [5]:
# O parâmetro index_col informa a coluna na qual o dataframe será indexado
df = pd.read_csv(arquivo, sep=',', index_col='date')

In [6]:
# Lendo o arquivo usando apenas as colunas informadas
df = pd.read_csv(arquivo, sep=',', usecols=['id','date','price','bedrooms','bathrooms'])

In [7]:
# Metodo head() imprime as 5 linhas iniciais do dataframe.
df.head()

           id             date     price  bedrooms  bathrooms
0  7129300520  20141013T000000  221900.0       3.0       1.00
1  6414100192  20141209T000000  538000.0       3.0       2.25
2  5631500400  20150225T000000  180000.0       2.0       1.00
3  2487200875  20141209T000000  604000.0       4.0       3.00
4  1954400510  20150218T000000  510000.0       3.0       2.00

In [8]:
# Imprimindo a 10 primeiras linhas do dataframe.
df.head(10)

           id             date      price  bedrooms  bathrooms
0  7129300520  20141013T000000   221900.0       3.0       1.00
1  6414100192  20141209T000000   538000.0       3.0       2.25
2  5631500400  20150225T000000   180000.0       2.0       1.00
3  2487200875  20141209T000000   604000.0       4.0       3.00
4  1954400510  20150218T000000   510000.0       3.0       2.00
5  7237550310  20140512T000000  1225000.0       4.0       4.50
6  1321400060  20140627T000000   257500.0       3.0       2.25
7  2008000270  20150115T000000   291850.0       3.0       1.50
8  2414600126  20150415T000000   229500.0       3.0       1.00
9  3793500160  20150312T000000   323000.0       3.0       2.50

In [9]:
# Atributo columns retorna o nome das colunas do dataframe.
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms'], dtype='object')

In [10]:
# Método count() retorna a quantidade de linhas de todas as colunas.
df.count()

id           21613
date         21613
price        21613
bedrooms     21609
bathrooms    21613
dtype: int64

In [11]:
# Método describe() exibe informações estatísticas da base de dados. 
# Várias informações como desvio padrão, média, valor mínimo e valor máximo de colunas.
df.describe()

                 id         price      bedrooms     bathrooms
count  2.161300e+04  2.161300e+04  21609.000000  21613.000000
mean   4.580302e+09  5.400881e+05      3.370910      2.114757
std    2.876566e+09  3.671272e+05      0.930084      0.770163
min    1.000102e+06  7.500000e+04      0.000000      0.000000
25%    2.123049e+09  3.219500e+05      3.000000      1.750000
50%    3.904930e+09  4.500000e+05      3.000000      2.250000
75%    7.308900e+09  6.450000e+05      4.000000      2.500000
max    9.900000e+09  7.700000e+06     33.000000      8.000000

In [12]:
# Imprime as 10 ultimas linhas .
df.tail(10)

               id             date      price  bedrooms  bathrooms
21603  7852140040  20140825T000000   507250.0       3.0       2.50
21604  9834201367  20150126T000000   429000.0       3.0       2.00
21605  3448900210  20141014T000000   610685.0       4.0       2.50
21606  7936000429  20150326T000000  1007500.0       4.0       3.50
21607  2997800021  20150219T000000   475000.0       3.0       2.50
21608   263000018  20140521T000000   360000.0       3.0       2.50
21609  6600060120  20150223T000000   400000.0       4.0       2.50
21610  1523300141  20140623T000000   402101.0       2.0       0.75
21611   291310100  20150116T000000   400000.0       3.0       2.50
21612  1523300157  20141015T000000   325000.0       2.0       0.75

In [13]:
# Imprime uma amostra aleatória do dataset.
df.sample(5)

               id             date     price  bedrooms  bathrooms
15465  5631500947  20150122T000000  610000.0       4.0       3.00
16560  1431700280  20150409T000000  310000.0       5.0       2.00
14524  9512500610  20150122T000000  485000.0       4.0       1.75
4113   8562700090  20141111T000000  462600.0       3.0       1.75
17531  2114700460  20140818T000000  249000.0       3.0       1.50

In [14]:
# Retorna em formato de tupla a quantidade de linhas e colunas do dataset.
df.shape

(21613, 5)

In [15]:
# Imprime informações sobre colunas e uso de memória.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 5 columns):
id           21613 non-null int64
date         21613 non-null object
price        21613 non-null float64
bedrooms     21609 non-null float64
bathrooms    21613 non-null float64
dtypes: float64(3), int64(1), object(1)
memory usage: 844.3+ KB

In [16]:
# Lista de colunas do DataFrame
df.columns.values

array(['id', 'date', 'price', 'bedrooms', 'bathrooms'], dtype=object)

In [17]:
# Valores unicos de uma coluna
df.bedrooms.unique()

array([ 3.,  2.,  4.,  5., nan,  1.,  6.,  7.,  0.,  8.,  9., 11., 10.,
       33.])

In [18]:
# Contar as ocorrencias unicas de cada valor no DataFrame
df.bedrooms.value_counts()

3.0     9822
4.0     6881
2.0     2759
5.0     1601
6.0      272
1.0      199
7.0       38
8.0       13
0.0       13
9.0        6
10.0       3
11.0       1
33.0       1
Name: bedrooms, dtype: int64

In [19]:
# Ou
df['bedrooms'].value_counts()

3.0     9822
4.0     6881
2.0     2759
5.0     1601
6.0      272
1.0      199
7.0       38
8.0       13
0.0       13
9.0        6
10.0       3
11.0       1
33.0       1
Name: bedrooms, dtype: int64

In [20]:
# Valores das colunas contados em porcentagem
df.bedrooms.value_counts(normalize=True)

3.0     0.454533
4.0     0.318432
2.0     0.127678
5.0     0.074089
6.0     0.012587
1.0     0.009209
7.0     0.001759
8.0     0.000602
0.0     0.000602
9.0     0.000278
10.0    0.000139
11.0    0.000046
33.0    0.000046
Name: bedrooms, dtype: float64

In [21]:
# Pega os indices do "agrupamento"
df.bedrooms.value_counts().index.tolist()

[3.0, 4.0, 2.0, 5.0, 6.0, 1.0, 7.0, 8.0, 0.0, 9.0, 10.0, 11.0, 33.0]

In [22]:
# Pega os valores do "agrupamento"
df.bedrooms.value_counts().values.tolist()

[9822, 6881, 2759, 1601, 272, 199, 38, 13, 13, 6, 3, 1, 1]

# Consultando um Dataset

In [23]:
# Conta a quantidade de valores únicos
pd.value_counts(df['bedrooms'])

3.0     9822
4.0     6881
2.0     2759
5.0     1601
6.0      272
1.0      199
7.0       38
8.0       13
0.0       13
9.0        6
10.0       3
11.0       1
33.0       1
Name: bedrooms, dtype: int64

In [24]:
# O método loc() é usado para visualizar informações do dataset.
# Este método recebe uma lista por parâmetro e retorna o resultado da consulta.
# Consulta imóveis com 3 quartos
df.loc[df['bathrooms'] > 7]

               id             date      price  bedrooms  bathrooms
7252   6762700020  20141013T000000  7700000.0       6.0       8.00
8546    424049043  20140811T000000   450000.0       9.0       7.50
9254   9208900037  20140919T000000  6885000.0       6.0       7.75
12777  1225069038  20140505T000000  2280000.0       7.0       8.00

In [25]:
# Usando o método loc() junto com o operador &
# Consulta imóveis com 3 quartos e com o número de banheiros maior que 2
df.loc[(df['bedrooms']==3) & (df['bathrooms'] >= 4)].head()

              id             date      price  bedrooms  bathrooms
450   4055700030  20150502T000000  1450000.0       3.0       4.50
471   8651611170  20150213T000000   868700.0       3.0       4.25
1261  7636800041  20140625T000000   995000.0       3.0       4.50
1987  1118002090  20140628T000000  1600000.0       3.0       4.25
4474  5701700011  20140523T000000  1050000.0       3.0       4.00

In [26]:
# O método sort_values() ordena o dataset pela coluna 'price' em ordem descrescente.
# Apenas o retorno da query será ordenado, não a organização do dataset.
df.sort_values(by='price', ascending=False).head()

              id             date      price  bedrooms  bathrooms
7252  6762700020  20141013T000000  7700000.0       6.0       8.00
3914  9808700762  20140611T000000  7062500.0       5.0       4.50
9254  9208900037  20140919T000000  6885000.0       6.0       7.75
4411  2470100110  20140804T000000  5570000.0       5.0       5.75
1448  8907500070  20150413T000000  5350000.0       5.0       5.00

In [27]:
# Usando o método count() para contar o número de linhas de uma query.
df[df['bedrooms']==4].count()

id           6881
date         6881
price        6881
bedrooms     6881
bathrooms    6881
dtype: int64

In [28]:
# Somando a coluna price com banheiros igual a 4
df[df['bathrooms']>=6]['price'].sum()

50070890.0

In [29]:
# Filtrar coluna com varios elementos de uma lista
df[df['bedrooms'].isin([3,4])].head()

           id             date      price  bedrooms  bathrooms
0  7129300520  20141013T000000   221900.0       3.0       1.00
1  6414100192  20141209T000000   538000.0       3.0       2.25
3  2487200875  20141209T000000   604000.0       4.0       3.00
4  1954400510  20150218T000000   510000.0       3.0       2.00
5  7237550310  20140512T000000  1225000.0       4.0       4.50

# Alterando o dataset

In [30]:
# Adicionando uma coluna ao Dataframe.
df['size'] = (df['bedrooms'] * 20)

In [31]:
# Visualizando o conteúdo da coluna criada.
df['size'].head()

0    60.0
1    60.0
2    40.0
3    80.0
4    60.0
Name: size, dtype: float64

In [32]:
# Criando uma função para processamento de dados.
def categoriza(s):
    if s >= 80:
        return 'Big'
    elif s >= 60:
        return 'Medium'
    elif s >= 40:
        return 'Small'

In [33]:
# Criando uma nova coluna a partir do processamento realizado.
df['cat_size'] = df['size'].apply(categoriza)

In [34]:
# Visualizando a nova coluna criada.
df['cat_size'].head()

0    Medium
1    Medium
2     Small
3       Big
4    Medium
Name: cat_size, dtype: object

In [35]:
# Ver a distribuicao da coluna com o método value_counts.
pd.value_counts(df['cat_size'])

Medium    9822
Big       8816
Small     2759
Name: cat_size, dtype: int64

In [36]:
# O método drop é usado para excluir dados no dataframe.
# A opção axis=1 define que queremos excluir uma coluna e não uma linha.
# O parâmetro inplace define que a alteração irá modificar o objeto em memória.

df.drop(['cat_size'], axis=1, inplace=True)

In [37]:
# Apagando a coluna 'size'
df.drop(['size'], axis=1, inplace=True)

In [38]:
# Visualizando o dataset.
df.head()

           id             date     price  bedrooms  bathrooms
0  7129300520  20141013T000000  221900.0       3.0       1.00
1  6414100192  20141209T000000  538000.0       3.0       2.25
2  5631500400  20150225T000000  180000.0       2.0       1.00
3  2487200875  20141209T000000  604000.0       4.0       3.00
4  1954400510  20150218T000000  510000.0       3.0       2.00

**Apagando linhas baseado em Condições lógicas!**

In [39]:
# Dropa linhas com bedrooms = 0
df.drop(df[df.bedrooms==0].index ,inplace=True)

In [40]:
# Dropa linhas maiores que 30
df.drop(df[df.bedrooms>30].index ,inplace=True)

# Missing Values

In [41]:
arquivo = 'dados/kc_house_data.csv'
df = pd.read_csv(arquivo, sep=',', header=0)

In [42]:
# Consultando linhas com valores faltantes.
df.isnull().sum()

id               0
date             0
price            0
bedrooms         4
bathrooms        0
sqft_living      0
sqft_lot         0
floors           1
waterfront       0
view             0
condition        0
grade            0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
zipcode          0
lat              0
long             0
sqft_living15    0
sqft_lot15       0
dtype: int64

In [43]:
#Com este comando removemos todas as linhas onde tenha pela menos um registro faltante em algum atributo.
df.dropna(inplace=True)

In [44]:
# É possível ainda, remover somente linhas que estejam com valores faltantes em todas as colunas, veja:
df.dropna(how='all', inplace=True)

In [45]:
#preenche com a media dos valores da coluns floors os values null
df['floors'].fillna(df['floors'].mean(), inplace=True)

In [46]:
#preenche com 1 os values null da coluna bedrooms
df['bedrooms'].fillna(1, inplace=True)

In [47]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3.0,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3.0,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2.0,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4.0,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3.0,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

# Trabalhando com Grandes Arquivos

In [48]:
# Lendo as 5 primeiras linhas do arquivo.
df = pd.read_csv(arquivo, sep=',')

In [49]:
# O parâmetro chunksize define em quantas linhas cada bloco irá conter.
chunk = pd.read_csv(arquivo, chunksize=10000)

In [50]:
type(chunk)

pandas.io.parsers.TextFileReader

In [51]:
# Imprimindo tamanho das partes do arquivo chunk.
for parte in chunk:
    print (len(parte))

10000
10000
1613

In [52]:
# Interese sobre cada parte do dataframe em seguida adicione o valor processado a uma nova coluna do dataset.
chunk = pd.read_csv(arquivo, chunksize=10000)
lista = []
for parte in chunk:
    lista.append(parte['bedrooms'] * 2)

df['bedrooms_size'] = pd.concat(lista)

In [53]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,bedrooms_size
0,7129300520,20141013T000000,221900.0,3.0,1.00,1180,5650,1.0,0,0,...,1180,0,1955,0,98178,47.5112,-122.257,1340,5650,6.0
1,6414100192,20141209T000000,538000.0,3.0,2.25,2570,7242,2.0,0,0,...,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639,6.0
2,5631500400,20150225T000000,180000.0,2.0,1.00,770,10000,1.0,0,0,...,770,0,1933,0,98028,47.7379,-122.233,2720,8062,4.0
3,2487200875,20141209T000000,604000.0,4.0,3.00,1960,5000,1.0,0,0,...,1050,910,1965,0,98136,47.5208,-122.393,1360,5000,8.0
4,1954400510,20150218T000000,510000.0,3.0,2.00,1680,8080,1.0,0,0,...,1680,0,1987,0,98074,47.6168,-122.045,1800,7503,6.0

# Estatistica Descritiva

In [54]:
# Média
df['bedrooms'].mean()

3.3709102688694523

In [55]:
# Máximo
df['bedrooms'].max()

33.0

In [56]:
# Mínimo da coluna bedrooms
df['bedrooms'].min()

0.0

In [57]:
# Desvio padrão da coluna bedrooms
df['bedrooms'].std()

0.9300844679399579

In [58]:
# Valor simetrico da coluna bedrooms
# Um valor zero indica uma distribuição simétrica
# Um valor maior que zero ou menor indica uma distribuição assimétrica.
# Valores acima de zero podemos dizer que existe uma assimetria positiva 
# Valores abaixo de zero uma assimetria negativa.
# Isso quer dizer que valores muito acima de zero indicam que existem mais valores acima da média
# valores abaixo de zero significa que contém mais valores abaixo da média.
df['bedrooms'].skew()

1.9744391609000942

In [59]:
# Correlação de todas as colunas do dataframe (person)
df.corr()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,bedrooms_size
id,1.000000,-0.016762,0.001235,0.005160,-0.012258,-0.132109,0.018595,-0.002721,0.011592,-0.023783,...,-0.010842,-0.005151,0.021380,-0.016907,-0.008224,-0.001891,0.020799,-0.002901,-0.138798,0.001235
price,-0.016762,1.000000,0.308321,0.525138,0.702035,0.089661,0.256791,0.266369,0.397293,0.036362,...,0.605567,0.323816,0.054012,0.126434,-0.053203,0.307003,0.021626,0.585379,0.082447,0.308321
bedrooms,0.001235,0.308321,1.000000,0.515929,0.576679,0.031684,0.175440,-0.006589,0.079515,0.028534,...,0.477618,0.303078,0.154197,0.018827,-0.152706,-0.008963,0.129498,0.391670,0.029221,1.000000
bathrooms,0.005160,0.525138,0.515929,1.000000,0.754665,0.087740,0.500626,0.063744,0.187737,-0.124982,...,0.685342,0.283770,0.506019,0.050739,-0.203866,0.024573,0.223042,0.568634,0.087175,0.515929
sqft_living,-0.012258,0.702035,0.576679,0.754665,1.000000,0.172826,0.353922,0.103818,0.284611,-0.058753,...,0.876597,0.435043,0.318049,0.055363,-0.199430,0.052529,0.240223,0.756420,0.183286,0.576679
sqft_lot,-0.132109,0.089661,0.031684,0.087740,0.172826,1.000000,-0.005210,0.021604,0.074710,-0.008958,...,0.183512,0.015286,0.053080,0.007644,-0.129574,-0.085683,0.229521,0.144608,0.718557,0.031684
floors,0.018595,0.256791,0.175440,0.500626,0.353922,-0.005210,1.000000,0.023695,0.029432,-0.263740,...,0.523863,-0.245708,0.489298,0.006330,-0.059093,0.049656,0.125399,0.279856,-0.011280,0.175440
waterfront,-0.002721,0.266369,-0.006589,0.063744,0.103818,0.021604,0.023695,1.000000,0.401857,0.016653,...,0.072075,0.080588,-0.026161,0.092885,0.030285,-0.014274,-0.041910,0.086463,0.030703,-0.006589
view,0.011592,0.397293,0.079515,0.187737,0.284611,0.074710,0.029432,0.401857,1.000000,0.045990,...,0.167649,0.276947,-0.053440,0.103917,0.084827,0.006157,-0.078400,0.280439,0.072575,0.079515
condition,-0.023783,0.036362,0.028534,-0.124982,-0.058753,-0.008958,-0.263740,0.016653,0.045990,1.000000,...,-0.158214,0.174105,-0.361417,-0.060618,0.003026,-0.014941,-0.106500,-0.092824,-0.003406,0.028534
grade,0.008130,0.667434,0.356972,0.664983,0.762704,0.113621,0.458171,0.082775,0.251321,-0.144674,...,0.755923,0.168392,0.446963,0.014414,-0.184862,0.114084,0.198372,0.713202,0.119248,0.356972
sqft_above,-0.010842,0.605567,0.477618,0.685342,0.876597,0.183512,0.523863,0.072075,0.167649,-0.158214,...,1.000000,-0.051943,0.423898,0.023285,-0.261190,-0.000816,0.343803,0.731870,0.194050,0.477618
sqft_basement,-0.005151,0.323816,0.303078,0.283770,0.435043,0.015286,-0.245708,0.080588,0.276947,0.174105,...,-0.051943,1.000000,-0.133124,0.071323,0.074845,0.110538,-0.144765,0.200355,0.017276,0.303078
yr_built,0.021380,0.054012,0.154197,0.506019,0.318049,0.053080,0.489298,-0.026161,-0.053440,-0.361417,...,0.423898,-0.133124,1.000000,-0.224874,-0.346869,-0.148122,0.409356,0.326229,0.070958,0.154197
yr_renovated,-0.016907,0.126434,0.018827,0.050739,0.055363,0.007644,0.006330,0.092885,0.103917,-0.060618,...,0.023285,0.071323,-0.224874,1.000000,0.064357,0.029398,-0.068372,-0.002673,0.007854,0.018827
zipcode,-0.008224,-0.053203,-0.152706,-0.203866,-0.199430,-0.129574,-0.059093,0.030285,0.084827,0.003026,...,-0.261190,0.074845,-0.346869,0.064357,1.000000,0.267048,-0.564072,-0.279033,-0.147221,-0.152706
lat,-0.001891,0.307003,-0.008963,0.024573,0.052529,-0.085683,0.049656,-0.014274,0.006157,-0.014941,...,-0.000816,0.110538,-0.148122,0.029398,0.267048,1.000000,-0.135512,0.048858,-0.086419,-0.008963
long,0.020799,0.021626,0.129498,0.223042,0.240223,0.229521,0.125399,-0.041910,-0.078400,-0.106500,...,0.343803,-0.144765,0.409356,-0.068372,-0.564072,-0.135512,1.000000,0.334605,0.254451,0.129498
sqft_living15,-0.002901,0.585379,0.391670,0.568634,0.756420,0.144608,0.279856,0.086463,0.280439,-0.092824,...,0.731870,0.200355,0.326229,-0.002673,-0.279033,0.048858,0.334605,1.000000,0.183192,0.391670
sqft_lot15,-0.138798,0.082447,0.029221,0.087175,0.183286,0.718557,-0.011280,0.030703,0.072575,-0.003406,...,0.194050,0.017276,0.070958,0.007854,-0.147221,-0.086419,0.254451,0.183192,1.000000,0.029221
bedrooms_size,0.001235,0.308321,1.000000,0.515929,0.576679,0.031684,0.175440,-0.006589,0.079515,0.028534,...,0.477618,0.303078,0.154197,0.018827,-0.152706,-0.008963,0.129498,0.391670,0.029221,1.000000

# Tabelas Pivot

In [60]:
# Tabelas Pivot são úteis para fazer agrupamento nos dados.
# Conta a quantidade de imóveis agrupados pelas colunas waterfront e floors.
# O parametro index informo as colunas que serão usadas para agregação.
# o parâmetro aggfunc é usado para definir a função de agregação, que poderia ser uma média por exemplo.
# O parâmetro margins=True calcula a quantidade total no final da tabela.

# Muito interessante a performance dessa operação.
df.pivot_table('id',index=["waterfront","floors"], aggfunc='count',margins=True)

                      id
waterfront floors
0          1.0     10622
           1.5      1889
           2.0      8166
           2.5       159
           3.0       605
           3.5         8
1          1.0        57
           1.5        21
           2.0        75
           2.5         2
           3.0         8
All                21612

In [61]:
# Crosstab ou tabulação Cruzada
# Essa funcionalidade cruza valores das variáveis
# Nesse exemplo podemos ver qual a distribuição dos imóvies por número de quartos com relação a sua condição
# Podemos ver que imoveis com 3 quartos estão mais na condição 5

pd.crosstab(df['bedrooms'],df['condition'])

condition   1   2     3     4    5
bedrooms
0.0         1   1    10     1    0
1.0         4  11   124    48   12
2.0        12  51  1779   717  200
3.0         8  69  6306  2711  728
4.0         4  36  4579  1682  580
5.0         0   1  1031   418  151
6.0         1   3   158    87   23
7.0         0   0    25     9    4
8.0         0   0     8     3    2
9.0         0   0     6     0    0
10.0        0   0     1     2    0
11.0        0   0     1     0    0
33.0        0   0     0     0    1

# Trabalhando com Excel

In [62]:
# Lendo uma planilha do excel no Pandas.
df_excel = pd.read_excel('dados/planilha_pandas.xls', sheetname=0,header=1)

D:\Programas\Anaconda3\lib\site-packages\pandas\io\excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

In [63]:
df_excel.head()

   7129300520   221900    3     1  1180  1.1  0
0  6414100192   538000  3.0  2.25  2570  2.0  0
1  5631500400   180000  2.0  1.00   770  1.0  0
2  2487200875   604000  4.0  3.00  1960  1.0  0
3  1954400510   510000  3.0  2.00  1680  1.0  0
4  7237550310  1225000  4.0  4.50  5420  1.0  0

In [64]:
df.to_excel('dados/planilhas_pandas2.xls',index=False)

# Merge

In [65]:
orders = pd.read_csv('dados/olist_orders_dataset.csv')

In [66]:
orders.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [67]:
orders_items = pd.read_csv('dados/olist_order_items_dataset.csv')

In [68]:
orders_items.head()

,order_id,order_item_id,product_id,seller_id,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,199.90,18.14

In [69]:
# Se n especificar, por padrão o pandas utiliza o inner join
consulta_inner = pd.merge(orders[['order_id','order_status','order_approved_at']],
                 orders_items[['order_id','product_id','seller_id','price','freight_value']],
                 on='order_id'
)

In [70]:
consulta_inner.head()

,order_id,order_status,order_approved_at,product_id,seller_id,price,freight_value
0,e481f51cbdc54678b7cc49136f2d6af7,delivered,2017-10-02 11:07:15,87285b34884572647811a353c7ac498a,3504c0cb71d7fa48d967e0e4c94d59d9,29.99,8.72
1,53cdb2fc8bc7dce0b6741e2150273451,delivered,2018-07-26 03:24:27,595fac2a385ac33a80bd5114aec74eb8,289cdb325fb7e7f891c38608bf9e0962,118.70,22.76
2,47770eb9100c2d0c44946d9cf07ec65d,delivered,2018-08-08 08:55:23,aa4383b373c6aca5d8797843e5594415,4869f7a5dfa277a7dca6462dcf3b52b2,159.90,19.22
3,949d5b44dbf5de918fe9c16f97b45f8a,delivered,2017-11-18 19:45:59,d0b61bfb1de832b15ba9d266ca96e5b0,66922902710d126a0e7d26b0e3805106,45.00,27.20
4,ad21c59c0840e6cb83a9ceb5573f8159,delivered,2018-02-13 22:20:29,65266b2da20d04dbe00c5c2d3bb7859e,2c9e548be18521d1c43cde1c582c6de8,19.90,8.72

In [71]:
consulta_left = pd.merge(orders[['order_id','order_status','order_approved_at']],
                 orders_items[['order_id','product_id','seller_id','price','freight_value']],
                 on='order_id',
                 how='left'
)

In [72]:
consulta_left.isnull().sum()

order_id               0
order_status           0
order_approved_at    161
product_id           775
seller_id            775
price                775
freight_value        775
dtype: int64

In [73]:
consulta_right = pd.merge(orders[['order_id','order_status','order_approved_at']],
                 orders_items[['order_id','product_id','seller_id','price','freight_value']],
                 on='order_id',
                 how='right'
)

In [74]:
consulta_right.isnull().sum()

order_id              0
order_status          0
order_approved_at    15
product_id            0
seller_id             0
price                 0
freight_value         0
dtype: int64